### Terragrunt Plan :memo:

```text
time=2024-07-22T16:17:14Z level=info msg=The stack at terraform will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/homelab/homelab/terraform/aliyun


Acquiring state lock. This may take a few moments...
module.nixos_hgh2.data.external.build: Reading...
module.nixos_hgh1.data.external.build: Reading...
module.nixos_hgh2.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh1.data.external.build: Still reading... [10s elapsed]
module.nixos_hgh1.data.external.keyscan: Reading...
module.nixos_hgh2.data.external.build: Read complete after 12s [id=-]
module.nixos_hgh1.data.external.build: Read complete after 12s [id=-]
module.nixos_hgh2.data.external.keyscan: Reading...
module.nixos_hgh1.data.external.keyscan: Read complete after 4s [id=-]
module.nixos_hgh2.data.external.keyscan: Read complete after 3s [id=-]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # local_file.known_hosts must be replaced
-/+ resource "local_file" "known_hosts" {
      ~ content              = <<-EOT # forces replacement
            47.96.145.133 ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJQOAm7547OZEO/RWy7ZiRlE5oeAU5MSN+aeA5X1jXiM
            47.96.145.133 ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCLFy58CPObaxFrkmLevoQEkH60TIfBCWQhTg9rZbFVcEztT6MB7ZaACuIlD4evVMVVU209LaE3dBRsew2cYTpGBweVO+zZbUYoKLrP0nzjjB2coMaX7Y+nO7zRrHiYOKBkjvqwnnbXxvcnncmCiQ0Q+oU+SYep7vKDaSiH6qSXRU6o8yjBiqBBvXbnzXrtWCjSz3d/nCC32HTkZMp8cPLnMhgs7VCaxdsVS5V3D63TFTFdhv1OfMJlIdK0c6ZuPOLwwvkb7aRVTJsYsmwyUmwrCq6gjIY0xf7K0IsFK78/4x26BBHuuztjDpbPogeoWWczpEByz9klHKaT5mcEaxJ8lUUYbNweayrZJXAmu82krHli8XxVBlJWIPgOY7BWK3ivKWFDSvkDhJp/oeIo3fOWUBMsKjpyst+WgRRGpu5V5sS9vJX0SRj/ulSwnnEQzZ9dSJTyEy9h3gcZs1u76ZImDzGlKDp6XchQy7FwYmZV+f8Hf80gP/b1/NqtXFxw3LBeB8NfwOfbakUpCOetPw+vkYsZ87ITB/1BuJFwbJEzi8WhMA1lJAGO/iKjZHtcVggLEqYLgNqKB4yzIIBsc27U07VHgYLaRFqEJfM7AomNo+8mGaXqem/wOjfC4Hj6vCqVAI4Kd8yyWSIGRnSQS6gPo+nEM5oH4ZZT5oJN8k0aXw==
            172.16.0.76 ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIChxC2I+mbcLhemJp2XffiJKIfPLt2Ir2+koOrvxzCfW
            172.16.0.76 ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDu4aXxRXQamCb7BiZlDqzdT1NCgulBwIqb27ue0gABu96gO13lrZdLOtOV9N/8ESvFcQhJCBR21vdyUs7yX4nw+3TCYWVxpSMHEwlW3B+gJrqqOu5Yc9pNo+KpabEsuDTEwLZQr71Eex/dmBHWRq45z/dao9bMYWIIokTD/MkwvsUSlICIi/HG3ZKTq5itTZoWRI4o6q1/0tjcmkke/nZjroGS/7Z4kY+8ehBzY+NnBDEDRvO+RkIf7OdqwrPcmXix6DemNRcaI+b6MNLiFQGEb9kpYGuYOtiEvQSCAvH3F93bpH4zpWZ+xeFGJ1EPRcyU+jhNI/8aDZLefsuDPf/6BKTe/wlEiModA7Wc7/7quEc6AabZn2mZ8Pc/CrXbcfumkhTQdydJxPI27DULgQ/NUZCPjfitu59cV6hHVnuVeLcEA9eEj+4uh0WGA9X570HQ+JfvtzaScOmIROXrEj/LuUXJ9pGo/YvUrueoZzAvH1qXMdx+NkARZG2fVT2G7Z4EU6ea8+HX/1jutYb26qTP2Z95IekG0S7XIo0PZaEOZV1ycV0yalW2WDtN67YTUdEbj7T9jhhZABZkpuwOIQZA9srokdCADlmVFnt3WOehKdzHs9a1Ytm1+0CA3oce4pUq5VqoZHdtCNlqI/y+rWkvQRbz+5fW741eZQ1vx0Rcow==
            172.16.0.78 ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICsB6i3THptH4mjE+dculUMv67/gBkOpdnj+MIPSMpmR
            172.16.0.78 ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQClVoPqgJ6bNKizWPLIk93fxA5A0SJuABEkNx0BYOjX7UuGhNFvH+nlnxo3JOqbmStz+IA8Q0ROZ/Jp6s+inNA0+kK8+9btrgN4cKo37NtAaeijNA6WdAbV9RFueYaiC3C8iG8N/ShfI7OKeYjZiLVFdxprLfgsmlJrA5f+HzTByCnKHAyc9yYeFqaUuVHB8quKvEWa6gaJVI0HJt0O2xeIQMWMhO4q/68YbiqWKPV16i+r8Hd+haSvU+cmOrJz1x6qUgymC6P1ppL1pNPyIQh8sqYJ+0Y/asILuRoi56r9YIogEVG/qlEK/vGdR9zuRCQixXYzUIRtuKLMSqFRdM3M8Jy5/5nyMle9JNFsVZa0HVVz5RgKBBhZR1gdUsN8zjV82XZ1U97aCtj+5YRrvYNwJezNI647n/Gk2GTZW8DO12HL8mkngJSIqX7QnCZgnQ0V7AoA0csbZjKie1+dBNqUM+XwuCJaor2giDHX8UjUfzb92QSRDQ1ybxfWJ9nF02TvFccj1JfMNvI+xkGIEbXGuLTe0KGBse3+zT4oRbYGM3I4AHUJpiCPVPjQie02O7qE8YVhLaxhZj2A6jkLHBOLTPqum+GVlXaxO+bZKD/8ZUQpxhqbG/QQmF4/mLnp9lfGtFFGqbuW+1RGcT9RhlgcBs38kVRhqIhKpqJP0TyltQ==
        EOT -> (known after apply) # forces replacement
      ~ content_base64sha256 = "bD6zaqW5JVreUno81EOFv9XN1Tkzlx5BMWd5KEfAdSo=" -> (known after apply)
      ~ content_base64sha512 = "LuQySD7qeUWqKMM7uqyVXrKNAaTS6Si2p/oDJ8qUGjP83OFF5C3239z8SqXo40Xd3RHd6BStZvo8WpdLVn+dfA==" -> (known after apply)
      ~ content_md5          = "98ee6fea0248e89548720715763bd67a" -> (known after apply)
      ~ content_sha1         = "e0e4803bd631f2c9f5b5fe7ca2a6cdd71609d8fb" -> (known after apply)
      ~ content_sha256       = "6c3eb36aa5b9255ade527a3cd44385bfd5cdd53933971e413167792847c0752a" -> (known after apply)
      ~ content_sha512       = "2ee432483eea7945aa28c33bbaac955eb28d01a4d2e928b6a7fa0327ca941a33fcdce145e42df6dfdcfc4aa5e8e345dddd11dde814ad66fa3c5a974b567f9d7c" -> (known after apply)
      ~ id                   = "e0e4803bd631f2c9f5b5fe7ca2a6cdd71609d8fb" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # local_file.sops_config must be replaced
-/+ resource "local_file" "sops_config" {
      ~ content              = <<-EOT # forces replacement
            keys:
              - &user_sun 8CC5C91F72DB57DA20BD848C6523836CF4992251
              - &github_action
                arn: arn:aws:kms:ap-southeast-1:137927498482:alias/sops-key
              - &host_desktop age1v6lnkm7prm0dpmcdpvn44v50rpfkzsed5uv3znxt4grsd5y6sv5qjru9qq
              - &host_hgh0 age1u69tnm577ep887ry5fg6nh725gwwrp5l0uwzwsf70knht7pgnq3ssdk346
              - &host_hgh1 age1s0sdahf03yxpfx5y5q07m30wygw8da3np0sz2nzj0sqrnhvj94kqsl2mhh
              - &host_hgh2 age1lawg2fw8nfmh4nuz9k76znqu96f786e3uk6hdccxkrae06qj9ugspyt5cg
            creation_rules:
              - path_regex: ^secrets/all-hosts\.yaml$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
                    age:
                      - *host_desktop
                      - *host_hgh0
                      - *host_hgh1
                      - *host_hgh2
              - path_regex: ^secrets/hosts/desktop\.yaml$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
                    age:
                      - *host_desktop
              - path_regex: ^secrets/hosts/hgh0\.yaml$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
                    age:
                      - *host_hgh0
              - path_regex: ^secrets/hosts/hgh1\.yaml$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
                    age:
                      - *host_hgh1
              - path_regex: ^secrets/hosts/hgh2\.yaml$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
                    age:
                      - *host_hgh2
              - path_regex: ^secrets/terraform/tofu-encryption\.json$
                key_groups:
                  - pgp:
                      - *user_sun
                    kms:
                      - *github_action
              - path_regex: ^.data/tfplans.tar.gz
                key_groups:
                  - kms:
                      - *github_action
        EOT -> (known after apply) # forces replacement
      ~ content_base64sha256 = "nD9mY8j146JdtMiQ5s7pOPVhF7sECAXOqY1oX8LtYcI=" -> (known after apply)
      ~ content_base64sha512 = "cO3PZrt6jkNY9G8clsZsiqee/umunnwiffUxhR6VDHcaDjHNLOH7lWL2DjsbGLUUeCDnORjppDLMF4bXxEdf1Q==" -> (known after apply)
      ~ content_md5          = "51ffc2bfc124f70c8d52db2e9ef232f5" -> (known after apply)
      ~ content_sha1         = "aa5d37a562bd6c98f84ddf84516cdf35678ea71b" -> (known after apply)
      ~ content_sha256       = "9c3f6663c8f5e3a25db4c890e6cee938f56117bb040805cea98d685fc2ed61c2" -> (known after apply)
      ~ content_sha512       = "70edcf66bb7a8e4358f46f1c96c66c8aa79efee9ae9e7c227df531851e950c771a0e31cd2ce1fb9562f60e3b1b18b5147820e73918e9a432cc1786d7c4475fd5" -> (known after apply)
      ~ id                   = "aa5d37a562bd6c98f84ddf84516cdf35678ea71b" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.nixos_hgh0.data.external.build will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "build" {
      + id      = (known after apply)
      + program = [
          + "../modules/nixos/build.sh",
        ]
      + query   = {
          + "attribute"   = "nixosConfigurations.\"hgh0\".config.system.build.toplevel"
          + "flake"       = ".?shallow=1"
          + "working_dir" = "../.."
        }
      + result  = (known after apply)
    }

  # module.nixos_hgh0.data.external.keyscan will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "keyscan" {
      + id      = (known after apply)
      + program = [
          + "../modules/nixos/keyscan.sh",
        ]
      + query   = {
          + "bastion_host" = null
          + "bastion_port" = "22"
          + "bastion_user" = "root"
          + "ssh_host"     = "47.96.145.133"
          + "ssh_port"     = "22"
        }
      + result  = (known after apply)
    }

  # module.nixos_hgh0.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "5255191168912331076" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/d4gz4z1pr10rv6444yk947472d696i3n-nixos-system-hgh0-24.11.20240719.1d9c2c9" -> (known after apply)
          ~ "known_hosts" = <<-EOT
                47.96.145.133 ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJQOAm7547OZEO/RWy7ZiRlE5oeAU5MSN+aeA5X1jXiM
                47.96.145.133 ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCLFy58CPObaxFrkmLevoQEkH60TIfBCWQhTg9rZbFVcEztT6MB7ZaACuIlD4evVMVVU209LaE3dBRsew2cYTpGBweVO+zZbUYoKLrP0nzjjB2coMaX7Y+nO7zRrHiYOKBkjvqwnnbXxvcnncmCiQ0Q+oU+SYep7vKDaSiH6qSXRU6o8yjBiqBBvXbnzXrtWCjSz3d/nCC32HTkZMp8cPLnMhgs7VCaxdsVS5V3D63TFTFdhv1OfMJlIdK0c6ZuPOLwwvkb7aRVTJsYsmwyUmwrCq6gjIY0xf7K0IsFK78/4x26BBHuuztjDpbPogeoWWczpEByz9klHKaT5mcEaxJ8lUUYbNweayrZJXAmu82krHli8XxVBlJWIPgOY7BWK3ivKWFDSvkDhJp/oeIo3fOWUBMsKjpyst+WgRRGpu5V5sS9vJX0SRj/ulSwnnEQzZ9dSJTyEy9h3gcZs1u76ZImDzGlKDp6XchQy7FwYmZV+f8Hf80gP/b1/NqtXFxw3LBeB8NfwOfbakUpCOetPw+vkYsZ87ITB/1BuJFwbJEzi8WhMA1lJAGO/iKjZHtcVggLEqYLgNqKB4yzIIBsc27U07VHgYLaRFqEJfM7AomNo+8mGaXqem/wOjfC4Hj6vCqVAI4Kd8yyWSIGRnSQS6gPo+nEM5oH4ZZT5oJN8k0aXw==
            EOT -> (known after apply)
        }
    }

  # module.nixos_hgh1.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "4571157682865990913" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/h1211cj63ld66llgbqwc45f20rp2m2n9-nixos-system-hgh1-24.11.20240719.1d9c2c9" -> "/nix/store/jxl3qjcybnvwdr91f3gz2ifavmfcf2jy-nixos-system-hgh1-24.11.20240719.1d9c2c9"
            # (1 unchanged element hidden)
        }
    }

  # module.nixos_hgh2.null_resource.deploy[0] must be replaced
-/+ resource "null_resource" "deploy" {
      ~ id       = "981888582540892630" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build"       = "/nix/store/wzlknsaj60iy0h4ki2p0zliil7fvy29w-nixos-system-hgh2-24.11.20240719.1d9c2c9" -> "/nix/store/jdjycbzwdkh5m30cwlbr5qfws7ir9fim-nixos-system-hgh2-24.11.20240719.1d9c2c9"
            # (1 unchanged element hidden)
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.
Releasing state lock. This may take a few moments...
```

**Status**: out of sync :warning: